// noinspection JSUnusedGlobalSymbols

/**
 * @Description Persian language pack
 * @Author: GitHub Copilot
 * @Date: 2025-06-01
 */
export default {
    website_info: { // نمایش اطلاعات وب‌سایت
        supported_to_nuitka_version: "پشتیبانی تا نسخه Nuitka",
        report_issue: "گزارش مشکل",
        nuitka_website: "وب‌سایت Nuitka",
        get_involved: "مشارکت کنید",
        changelog: "تاریخچه تغییرات",
        project_homepage: "صفحه اصلی پروژه",
        github_website: "استفاده در وب‌سایت",
        local_use: "استفاده محلی",
        current_version_author: "مشارکت‌کنندگان نسخه فعلی",
        open_source_license: "مجوز متن‌باز",
        long_info: {
            license: "ما از مجوز متن‌باز GPLv3 استفاده می‌کنیم، می‌توانید مجوز کامل را در اینجا مشاهده کنید:",
            author: "تا نسخه فعلی، تشکر از مشارکت‌کنندگان زیر برای مشارکت‌شان در این پروژه (بدون ترتیب خاص):",
        },
    },
    setting: { // صفحه تنظیمات
        guide: {
            title: "راهنما",
            start: "شروع راهنما",
        },
        theme: {
            auto: "دنبال کردن سیستم",
            light: "حالت روشن",
            dark: "حالت تاریک",
            theme: "تم",
        },
        language: {
            title: "زبان",
            interface_language: "زبان رابط",
            command_language: "زبان دستور",
        },
        nuitka_language_no_support: "نسخه فعلی Nuitka این زبان را پشتیبانی نمی‌کند",
        storage: {
            title: "تنظیمات ذخیره‌سازی",
            user: "تنظیمات کاربر",
            reset_user: "بازنشانی تنظیمات کاربر",
            command: "تنظیمات دستور",
            reset_command: "بازنشانی تنظیمات دستور",
        },
    },
    nav_bar: { // نوار ناوبری
        mode: {
            easy_mode: "حالت آسان",
            full_mode: "حالت کامل",
            info: {
                l1: "آیا لیست کامل دستورات نمایش داده شود",
                l2: "حالت آسان: گزینه‌های پرکاربرد Nuitka را نمایش دهید",
                l3: "حالت کامل: تمام گزینه‌های موجود را نمایش دهید",
            },
            show_raw_command: "نمایش دستور خام",
            no_show_raw_command: "مخفی کردن دستور خام",
            show_raw_command_info: "آیا دستور خام در تمام گزینه‌ها نمایش داده شود",
        },
        now_nuitka_version: "نسخه فایل پیکربندی انتخاب شده فعلی:",
        select_nuitka_version: "نسخه Nuitka که استفاده می‌کنید را انتخاب کنید",
    },
    tabs: {
        edit: "ویرایش",
        output: "خروجی",
        input: "ورودی",
    },
    input_page: {
        input_from_cli: "وارد کردن از خط فرمان",
        start_input: "شروع وارد کردن",
        please_input_cli_command: "لطفا دستور خط فرمان Nuitka را وارد کنید",
        general: {
            unable_parse_check: "ویژگی‌های ناشناخته‌ای در داده‌های ارائه شده وجود دارد، لطفا بررسی کنید که آیا داده‌های ورودی الزامات را برآورده می‌کند یا به صورت دستی وارد کنید",
            please_check_down: "ویژگی‌های ناشناخته‌ای در داده‌های ارائه شده وجود دارد، لطفا زیر را بررسی کنید",
        },
        json: {
            input_from_json: "وارد کردن از JSON",
            please_input_json: "لطفا داده‌های JSON صادر شده از این وب‌سایت را وارد کنید",
            json_parse_error: "تجزیه JSON ناموفق بود، لطفا بررسی کنید که آیا داده‌های ورودی در فرمت JSON هستند",
        },
        cli: {
            wait_bash_parser: "لطفا منتظر بارگیری Bash Parser باشید",
            unsupported_operate: "خطای ورودی - عملگر پشتیبانی نشده، لطفا ورودی خود را بررسی کنید",
            error_command: "خطای ورودی - خطای دستور، لطفا اطمینان حاصل کنید که دستور شما درست است و نسخه صحیح Nuitka را انتخاب کرده‌اید",
        },
    },
    nuitka_elements: {
        select_placeholder: "انتخاب",
        not_selected: "انتخاب نشده",
        selected: "انتخاب شده",
        user_provide: "این گزینه سفارشی شما است",
        add_option: "افزودن گزینه",
        input_an_option: "یک گزینه وارد کنید",
        option_desc: "توضیح گزینه",
    },
    message: {
        will_del_option: "شما در حال حذف این گزینه سفارشی هستید",
        continue_del: "آیا می‌خواهید ادامه دهید؟",
        warning: "هشدار",
        OK: "تأیید",
        cancel: "لغو",
        cancel_del: "حذف لغو شد",
        del_success: "با موفقیت حذف شد",
        have_been_created: "این گزینه قبلاً وجود دارد!",
        drop_file: "فایل را به اینجا بکشید",
        or: "یا",
        click_select_file: "انتخاب فایل",
        next_step: "مرحله بعد",
        prev_step: "مرحله قبل",
        data_input_success: "داده‌ها با موفقیت وارد شدند",
        calling: "در حال تماس، لطفا صبر کنید",
    },
    output_page: {
        run_nuitka_through_python: "اجرای Nuitka از طریق Python",
        CLI: "خروجی خط فرمان",
        JSON: "خروجی JSON",
    },
    // راهنمای کاربر
    website_guide: {
        start: {
            title: "راهنمای کاربر",
            desc: "به Nuitka Commander خوش آمدید، در ادامه، لطفا روی گوشه پایین راست کلیک کنید، بیایید گام به گام یاد بگیریم چگونه از آن استفاده کنیم",
        },
        navbar: {
            title: "نوار ناوبری",
            desc: "این نوار ناوبری است، جایی که برخی از عملکردهای سراسری تنظیم شده‌اند",
        },
        navbar_original_command: {
            title: "نوار ناوبری - تغییر وضعیت دستور خام",
            desc: "در اینجا می‌توانید تغییر دهید که آیا دستور خام Nuitka برای مشاهده آسان نمایش داده شود. می‌توانید تغییر وضعیت را امتحان کنید",
        },
        navbar_version_select: {
            title: "نوار ناوبری - انتخاب نسخه",
            desc: "در جعبه انتخاب سمت راست، می‌توانید نسخه‌های مختلف Nuitka را انتخاب کنید. می‌توانید فایل پیکربندی مناسب برای نسخه خود را پیدا کنید. اگر دستور ساده‌تری می‌خواهید، می‌توانید 'حالت آسان' را در پایین انتخاب کنید",
        },
        navbar_settings_button: {
            title: "نوار ناوبری - دکمه تنظیمات",
            desc: "روی این دکمه کلیک کنید تا وارد صفحه تنظیمات شوید",
        },
        settings_page: {
            title: "صفحه تنظیمات",
            desc: "بعدی، صفحه تنظیمات است",
        },
        settings_page_intro: {
            title: "صفحه تنظیمات - مقدمه",
            desc: "این رابط تنظیمات است، جایی که می‌توانید تنظیمات مورد نظر خود را تنظیم کنید",
        },
        settings_page_tour: {
            title: "صفحه تنظیمات - راهنما",
            desc: "برای مشاهده مجدد راهنما در آینده، می‌توانید اینجا کلیک کنید",
        },
        edit_page_buffer: {
            title: "صفحه ویرایش",
            desc: "بعدی، صفحه ویرایش است",
        },
        edit_page_intro: {
            title: "صفحه ویرایش - مقدمه",
            desc: "این صفحه ویرایش است، جایی که می‌توانید دستورات Nuitka خود را پیکربندی کنید. می‌توانید روی سمت چپ کلیک کنید تا دسته‌های دستور را تغییر دهید و دستورات را در وسط ویرایش کنید",
        },
        edit_page_edit_box: {
            title: "صفحه ویرایش - جعبه ویرایش",
            desc: "جعبه‌های ویرایش زیادی در اینجا وجود دارد، هر کدام یک پارامتر را نمایندگی می‌کند. اگر ماوس را روی آن نگه دارید، مقدمه تفصیلی وجود خواهد داشت. اکنون امتحان کنید",
        },
        output_page_intro: {
            title: "صفحه خروجی - مقدمه",
            desc: "این صفحه خروجی است، جایی که می‌توانید نتایج خروجی دستوراتی که تازه ویرایش کرده‌اید را دریافت کنید. می‌توانید روی سمت چپ کلیک کنید تا نوع خروجی را تغییر دهید و دستور خروجی را در وسط مشاهده کنید. روی گوشه بالا راست کلیک کنید تا دستور را مستقیماً کپی کنید. البته، می‌توانید ماوس را روی هر عنصر نگه دارید تا مقدمه‌های تفصیلی را ببینید.",
        },
        input_page_intro: {
            title: "صفحه ورودی - مقدمه",
            desc: "این صفحه ورودی است، جایی که می‌توانید دستورات را وارد کنید و سپس آنها را برای ویرایش به Nuitka Commander وارد کنید. می‌توانید روی سمت چپ کلیک کنید تا نوع ورودی را تغییر دهید و در گوشه بالا راست وارد کردن را شروع کنید.",
        },
        website_footer: {
            title: "پاورقی وب‌سایت",
            desc: "این پاورقی وب‌سایت است، جایی که می‌توانید برخی از پیوندهای مفید، مانند وب‌سایت Nuitka و صفحه اصلی پروژه پیدا کنید. همچنین می‌توانید شماره نسخه پروژه، نویسندگان و اطلاعات دیگر را پیدا کنید",
        },
        end: {
            title: "پایان",
            desc: "راهنما در اینجا به پایان می‌رسد، از استفاده متشکریم. اگر سوال یا پیشنهادی دارید، احساس راحتی کنید که در GitHub مسئله ایجاد کنید",
        },
    },
    search: { // جستجو
        search_placeholder: "جستجو",
        please_input: "لطفا محتوای جستجو را وارد کنید",
        no_result: "گزینه‌ای حاوی این کلمه کلیدی پیدا نشد",
        try_keyword: "لطفا تلاش کنید با کلمات کلیدی دیگر جایگزین کنید و دوباره جستجو کنید",
        jump: "پرش",
        select: "انتخاب",
        exit: "خروج",
    },
    // عناوین نسخه فایل پیکربندی، اگر می‌خواهید، می‌توانید برای هر نسخه عنوانی بدهید. در غیر این صورت، نام کلید پیش‌فرض استفاده خواهد شد
    nuitka_config_title: {
        simple: "حالت ساده",
    },
};
